t-gabor/OpenSprinkler-ESP8266-WIFI-6-Channels-Relay-Module-Wemos-Mini-Pro/OpenSprinkler.cpp
/** Get station data */
void OpenSprinkler::get_station_data(byte sid, StationData* data) {
	file_read_block(STATIONS_FILENAME, data, (uint32_t)sid*sizeof(StationData), sizeof(StationData));
}

/** Set station data */
void OpenSprinkler::set_station_data(byte sid, StationData* data) {
	file_write_block(STATIONS_FILENAME, data, (uint32_t)sid*sizeof(StationData), sizeof(StationData));
}

/** Get station name */
void OpenSprinkler::get_station_name(byte sid, char tmp[]) {
	tmp[STATION_NAME_SIZE]=0;
	file_read_block(STATIONS_FILENAME, tmp, (uint32_t)sid*sizeof(StationData)+offsetof(StationData, name), STATION_NAME_SIZE); 
}

/** Set station name */
void OpenSprinkler::set_station_name(byte sid, char tmp[]) {
	// todo: store the right size
	tmp[STATION_NAME_SIZE]=0;
	file_write_block(STATIONS_FILENAME, tmp, (uint32_t)sid*sizeof(StationData)+offsetof(StationData, name), STATION_NAME_SIZE);
}

/** Get station type */
byte OpenSprinkler::get_station_type(byte sid) {
	return file_read_byte(STATIONS_FILENAME, (uint32_t)sid*sizeof(StationData)+offsetof(StationData, type));
}

/** Get station attribute */
/*void OpenSprinkler::get_station_attrib(byte sid, StationAttrib *attrib); {
	file_read_block(STATIONS_FILENAME, attrib, (uint32_t)sid*sizeof(StationData)+offsetof(StationData, attrib), sizeof(StationAttrib));
}*/

/** Save all station attribs to file (backward compatibility) */
void OpenSprinkler::attribs_save() {
	// re-package attribute bits and save
	byte bid, s, sid=0;
	StationAttrib at;
	byte ty = STN_TYPE_STANDARD;
	for(bid=0;bid<MAX_NUM_BOARDS;bid++) {
		for(s=0;s<8;s++,sid++) {
			at.mas = (attrib_mas[bid]>>s) & 1;
			at.igs = (attrib_igs[bid]>>s) & 1;
			at.mas2= (attrib_mas2[bid]>>s)& 1;
			at.igs2= (attrib_igs2[bid]>>s) & 1;
			at.igrd= (attrib_igrd[bid]>>s) & 1;			 
			at.dis = (attrib_dis[bid]>>s) & 1;
			at.seq = (attrib_seq[bid]>>s) & 1;
			at.gid = 0;
			file_write_block(STATIONS_FILENAME, &at, (uint32_t)sid*sizeof(StationData)+offsetof(StationData, attrib), 1); // attribte bits are 1 byte long
			if(attrib_spe[bid]>>s==0) {
				// if station special bit is 0, make sure to write type STANDARD
				file_write_block(STATIONS_FILENAME, &ty, (uint32_t)sid*sizeof(StationData)+offsetof(StationData, type), 1); // attribte bits are 1 byte long
			}
		}
	}
}

/** Load all station attribs from file (backward compatibility) */
void OpenSprinkler::attribs_load() {
	// load and re-package attributes
	byte bid, s, sid=0;
	StationAttrib at;
	byte ty;
	memset(attrib_mas, 0, nboards);
	memset(attrib_igs, 0, nboards);
	memset(attrib_mas2, 0, nboards);
	memset(attrib_igs2, 0, nboards);
	memset(attrib_igrd, 0, nboards);
	memset(attrib_dis, 0, nboards);
	memset(attrib_seq, 0, nboards);
	memset(attrib_spe, 0, nboards);
								
	for(bid=0;bid<MAX_NUM_BOARDS;bid++) {
		for(s=0;s<8;s++,sid++) {
			file_read_block(STATIONS_FILENAME, &at, (uint32_t)sid*sizeof(StationData)+offsetof(StationData, attrib), sizeof(StationAttrib));
			attrib_mas[bid] |= (at.mas<<s);
			attrib_igs[bid] |= (at.igs<<s);
			attrib_mas2[bid]|= (at.mas2<<s);
			attrib_igs2[bid]|= (at.igs2<<s);
			attrib_igrd[bid]|= (at.igrd<<s);
			attrib_dis[bid] |= (at.dis<<s);
			attrib_seq[bid] |= (at.seq<<s);
			file_read_block(STATIONS_FILENAME, &ty, (uint32_t)sid*sizeof(StationData)+offsetof(StationData, type), 1);
			if(ty!=STN_TYPE_STANDARD) {
				attrib_spe[bid] |= (1<<s);
			}
		}
	}
}

/** verify if a string matches password */
byte OpenSprinkler::password_verify(char *pw) {
	return (file_cmp_block(SOPTS_FILENAME, pw, SOPT_PASSWORD*MAX_SOPTS_SIZE)==0) ? 1 : 0;
}

// ==================
// Schedule Functions
// ==================

/** Index of today's weekday (Monday is 0) */
byte OpenSprinkler::weekday_today() {
	//return ((byte)weekday()+5)%7; // Time::weekday() assumes Sunday is 1
#if defined(ARDUINO)
	ulong wd = now_tz() / 86400L;
	return (wd+3) % 7;	// Jan 1, 1970 is a Thursday
#else
	return 0;
	// todo future: is this function needed for RPI/BBB?
#endif
}

/** Switch special station */
void OpenSprinkler::switch_special_station(byte sid, byte value) {
	// check if this is a special station
	byte stype = get_station_type(sid);
	if(stype!=STN_TYPE_STANDARD) {
		// read station data
		StationData *pdata=(StationData*) tmp_buffer;
		get_station_data(sid, pdata);
		switch(stype) {
		
		case STN_TYPE_RF:
			switch_rfstation((RFStationData *)pdata->sped, value);
			break;
			
		case STN_TYPE_REMOTE:
			switch_remotestation((RemoteStationData *)pdata->sped, value);
			break;
			
		case STN_TYPE_GPIO:
			switch_gpiostation((GPIOStationData *)pdata->sped, value);
			break;
			
		case STN_TYPE_HTTP:
			switch_httpstation((HTTPStationData *)pdata->sped, value);
			break;
		}
	}
}

/** Set station bit
 * This function sets/resets the corresponding station bit variable
 * You have to call apply_all_station_bits next to apply the bits
 * (which results in physical actions of opening/closing valves).
 */
byte OpenSprinkler::set_station_bit(byte sid, byte value) {
	byte *data = station_bits+(sid>>3);  // pointer to the station byte
	byte mask = (byte)1<<(sid&0x07); // mask
	if (value) {
		if((*data)&mask) return 0;	// if bit is already set, return no change
		else {
			(*data) = (*data) | mask;
			engage_booster = true; // if bit is changing from 0 to 1, set engage_booster
			switch_special_station(sid, 1); // handle special stations
			return 1;
		}
	} else {
		if(!((*data)&mask)) return 0; // if bit is already reset, return no change
		else {
			(*data) = (*data) & (~mask);
			if(hw_type == HW_TYPE_LATCH) {
				engage_booster = true;	// if LATCH controller, engage booster when bit changes
			}
			switch_special_station(sid, 0); // handle special stations
			return 255;
		}
	}
	return 0;
}

/** Clear all station bits */
void OpenSprinkler::clear_all_station_bits() {
	byte sid;
	for(sid=0;sid<=MAX_NUM_STATIONS;sid++) {
		set_station_bit(sid, 0);
	}
}

#if !defined(ARDUINO)
int rf_gpio_fd = -1;
#endif

/** Transmit one RF signal bit */
void transmit_rfbit(ulong lenH, ulong lenL) {
#if defined(ARDUINO)
	#if defined(ESP8266)
		digitalWrite(PIN_RFTX, 1);
		delayMicroseconds(lenH);
		digitalWrite(PIN_RFTX, 0);
		delayMicroseconds(lenL);
	#else
		PORT_RF |= (1<<PINX_RF);
		delayMicroseconds(lenH);
		PORT_RF &=~(1<<PINX_RF);
		delayMicroseconds(lenL);
	#endif
#else
	gpio_write(rf_gpio_fd, 1);
	delayMicrosecondsHard(lenH);
	gpio_write(rf_gpio_fd, 0);
	delayMicrosecondsHard(lenL);
#endif
}

/** Transmit RF signal */
void send_rfsignal(ulong code, ulong len) {
	ulong len3 = len * 3;
	ulong len31 = len * 31;
	for(byte n=0;n<15;n++) {
		int i=23;
		// send code
		while(i>=0) {
			if ((code>>i) & 1) {
				transmit_rfbit(len3, len);
			} else {
				transmit_rfbit(len, len3);
			}
			i--;
		};
		// send sync
		transmit_rfbit(len, len31);
	}
}

/** Switch RF station
 * This function takes a RF code,
 * parses it into signals and timing,
 * and sends it out through RF transmitter.
 */
void OpenSprinkler::switch_rfstation(RFStationData *data, bool turnon) {
	ulong on, off;
	uint16_t length = parse_rfstation_code(data, &on, &off);
#if defined(ARDUINO)
	#if defined(ESP8266)
	rfswitch.enableTransmit(PIN_RFTX);
	rfswitch.setProtocol(1);
	rfswitch.setPulseLength(length);
	rfswitch.send(turnon ? on : off, 24);
	#else
	send_rfsignal(turnon ? on : off, length);
	#endif
#else
	// pre-open gpio file to minimize overhead
	rf_gpio_fd = gpio_fd_open(PIN_RFTX);
	send_rfsignal(turnon ? on : off, length);
	gpio_fd_close(rf_gpio_fd);
	rf_gpio_fd = -1;
#endif

